waveshareteam/Waveshare-ESP32-components/bsp/esp32_c6_touch_amoled_1_8/esp32_c6_touch_amoled_1_8.c
/*
 * SPDX-FileCopyrightText: 2026 Waveshare Team
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include <stdio.h>
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_io_additions.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_vfs_fat.h"
#include "esp_spiffs.h"
#include "driver/gpio.h"
#include "driver/sdspi_host.h"
#include "driver/spi_master.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "esp_lcd_co5300.h"
#include "esp_lcd_sh8601.h"
#include "esp_lcd_touch_cst816s.h"
#include "esp_lcd_touch_ft5x06.h"

#include "esp_codec_dev_defaults.h"
#include "bsp/esp32_c6_touch_amoled_1_8.h"
#include "bsp_err_check.h"
#include "bsp/display.h"
#include "bsp/touch.h"

static const char *TAG = "ESP32-C6-Touch-AMOLED-1.8";

static i2c_master_bus_handle_t i2c_handle = NULL;
static bool i2c_initialized = false;
static esp_io_expander_handle_t io_expander = NULL;
static bool display_touch_reset_done = false;
static bsp_board_variant_t board_variant = BSP_BOARD_VARIANT_UNKNOWN;
static lv_indev_t *disp_indev = NULL;
sdmmc_card_t *bsp_sdcard = NULL;
static esp_lcd_touch_handle_t tp = NULL;
static esp_lcd_panel_handle_t panel_handle = NULL;
static esp_lcd_panel_io_handle_t io_handle = NULL;
static uint8_t brightness = 0;
static i2s_chan_handle_t i2s_tx_chan = NULL;
static i2s_chan_handle_t i2s_rx_chan = NULL;
static const audio_codec_data_if_t *i2s_data_if = NULL;
static bool lcd_spi_initialized = false;

#define BSP_TOUCH_RESET_DELAY_MS (200)
#define BSP_LCD_CO5300_X_GAP (0x10)

#define BSP_I2S_GPIO_CFG       \
    {                          \
        .mclk = BSP_I2S_MCLK,  \
        .bclk = BSP_I2S_SCLK,  \
        .ws = BSP_I2S_LCLK,    \
        .dout = BSP_I2S_DOUT,  \
        .din = BSP_I2S_DSIN,   \
        .invert_flags = {      \
            .mclk_inv = false, \
            .bclk_inv = false, \
            .ws_inv = false,   \
        },                     \
    }

static const sh8601_lcd_init_cmd_t sh8601_lcd_init_cmds[] = {
    {0x11, (uint8_t[]){0x00}, 0, 120},
    {0x44, (uint8_t[]){0x01, 0xD1}, 2, 0},
    {0x35, (uint8_t[]){0x00}, 1, 0},
    {0x53, (uint8_t[]){0x20}, 1, 10},
    {0x2A, (uint8_t[]){0x00, 0x00, 0x01, 0x6F}, 4, 0},
    {0x2B, (uint8_t[]){0x00, 0x00, 0x01, 0xBF}, 4, 0},
    {0x51, (uint8_t[]){0x00}, 1, 10},
    {0x29, (uint8_t[]){0x00}, 0, 10},
    {0x51, (uint8_t[]){0xFF}, 1, 0},
};

static const co5300_lcd_init_cmd_t co5300_lcd_init_cmds[] = {
    {0xFE, (uint8_t[]){0x00}, 1, 0},
    {0xC4, (uint8_t[]){0x80}, 1, 0},
    {0x3A, (uint8_t[]){0x55}, 1, 0},
    {0x35, (uint8_t[]){0x00}, 1, 0},
    {0x53, (uint8_t[]){0x20}, 1, 0},
    {0x51, (uint8_t[]){0xFF}, 1, 0},
    {0x63, (uint8_t[]){0xFF}, 1, 0},
    {0x2A, (uint8_t[]){0x00, 0x00, 0x01, 0x6F}, 4, 0},
    {0x2B, (uint8_t[]){0x00, 0x00, 0x01, 0xBF}, 4, 0},
    {0x11, (uint8_t[]){0x00}, 0, 100},
    {0x29, (uint8_t[]){0x00}, 0, 0},
};

#define BSP_I2S_DUPLEX_MONO_CFG(_sample_rate)                                                         \
    {                                                                                                 \
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(_sample_rate),                                          \
        .slot_cfg = I2S_STD_PHILIP_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO), \
        .gpio_cfg = BSP_I2S_GPIO_CFG,                                                                 \
    }

/**************************************************************************************************
 *
 * I2C Function
 *
 **************************************************************************************************/
esp_err_t bsp_i2c_init(void)
{
    /* I2C was initialized before */
    if (i2c_initialized)
    {
        return ESP_OK;
    }

    i2c_master_bus_config_t i2c_bus_conf = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .sda_io_num = BSP_I2C_SDA,
        .scl_io_num = BSP_I2C_SCL,
        .i2c_port = BSP_I2C_NUM,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
        .trans_queue_depth = 0,
    };
    BSP_ERROR_CHECK_RETURN_ERR(i2c_new_master_bus(&i2c_bus_conf, &i2c_handle));

    i2c_initialized = true;

    return ESP_OK;
}

esp_err_t bsp_i2c_deinit(void)
{
    if (!i2c_initialized) {
        return ESP_OK;
    }

    if (io_expander != NULL) {
        BSP_ERROR_CHECK_RETURN_ERR(esp_io_expander_del(io_expander));
        io_expander = NULL;
    }
    BSP_ERROR_CHECK_RETURN_ERR(i2c_del_master_bus(i2c_handle));
    i2c_handle = NULL;
    i2c_initialized = false;
    display_touch_reset_done = false;
    board_variant = BSP_BOARD_VARIANT_UNKNOWN;
    return ESP_OK;
}

i2c_master_bus_handle_t bsp_i2c_get_handle(void)
{
    if (bsp_i2c_init() != ESP_OK) {
        return NULL;
    }
    return i2c_handle;
}

static esp_err_t bsp_i2c_device_probe(uint8_t addr)
{
    return i2c_master_probe(i2c_handle, addr, 100);
}

static esp_err_t bsp_display_touch_reset(void)
{
    if (display_touch_reset_done) {
        return ESP_OK;
    }

    esp_io_expander_handle_t expander = bsp_io_expander_init();
    ESP_RETURN_ON_FALSE(expander != NULL, ESP_FAIL, TAG, "Failed to initialize TCA9554");
    ESP_RETURN_ON_ERROR(
        esp_io_expander_set_dir(expander, BSP_LCD_RST | BSP_LCD_TOUCH_RST, IO_EXPANDER_OUTPUT), TAG, "");
    ESP_RETURN_ON_ERROR(
        esp_io_expander_set_level(expander, BSP_LCD_RST | BSP_LCD_TOUCH_RST, false), TAG, "");
    vTaskDelay(pdMS_TO_TICKS(BSP_TOUCH_RESET_DELAY_MS));
    ESP_RETURN_ON_ERROR(
        esp_io_expander_set_level(expander, BSP_LCD_RST | BSP_LCD_TOUCH_RST, true), TAG, "");
    vTaskDelay(pdMS_TO_TICKS(BSP_TOUCH_RESET_DELAY_MS));
    display_touch_reset_done = true;
    return ESP_OK;
}

bsp_board_variant_t bsp_board_detect(void)
{
    if (board_variant != BSP_BOARD_VARIANT_UNKNOWN) {
        return board_variant;
    }

    if (bsp_i2c_init() != ESP_OK || bsp_display_touch_reset() != ESP_OK) {
        return BSP_BOARD_VARIANT_UNKNOWN;
    }

    if (bsp_i2c_device_probe(BSP_TOUCH_CST820_I2C_ADDRESS) == ESP_OK) {
        board_variant = BSP_BOARD_VARIANT_CO5300_CST820;
    } else if (bsp_i2c_device_probe(BSP_TOUCH_FT5X06_I2C_ADDRESS) == ESP_OK) {
        board_variant = BSP_BOARD_VARIANT_SH8601_FT5X06;
    } else {
        ESP_LOGE(TAG, "No supported touch controller found at 0x%02X or 0x%02X",
                 BSP_TOUCH_CST820_I2C_ADDRESS, BSP_TOUCH_FT5X06_I2C_ADDRESS);
        return BSP_BOARD_VARIANT_UNKNOWN;
    }

    ESP_LOGI(TAG, "Detected board variant: %s", bsp_board_variant_to_name(board_variant));
    return board_variant;
}

bsp_board_variant_t bsp_board_get_variant(void)
{
    return board_variant;
}

const char *bsp_board_variant_to_name(bsp_board_variant_t variant)
{
    switch (variant) {
    case BSP_BOARD_VARIANT_SH8601_FT5X06:
        return "V1 (SH8601 + FT5x06)";
    case BSP_BOARD_VARIANT_CO5300_CST820:
        return "V2 (CO5300 + CST820)";
    default:
        return "unknown";
    }
}

esp_err_t bsp_spiffs_mount(void)
{
    esp_vfs_spiffs_conf_t conf = {
        .base_path = CONFIG_BSP_SPIFFS_MOUNT_POINT,
        .partition_label = CONFIG_BSP_SPIFFS_PARTITION_LABEL,
        .max_files = CONFIG_BSP_SPIFFS_MAX_FILES,
#ifdef CONFIG_BSP_SPIFFS_FORMAT_ON_MOUNT_FAIL
        .format_if_mount_failed = true,
#else
        .format_if_mount_failed = false,
#endif
    };

    esp_err_t ret_val = esp_vfs_spiffs_register(&conf);

