waveshareteam/Waveshare-ESP32-components/bsp/esp32_c6_touch_amoled_1_8/esp32_c6_touch_amoled_1_8.c
    es8311_codec_cfg_t es8311_cfg = {
        .ctrl_if = i2c_ctrl_if,
        .gpio_if = gpio_if,
        .codec_mode = ESP_CODEC_DEV_WORK_MODE_BOTH,
        .pa_pin = GPIO_NUM_NC,
        .pa_reverted = false,
        .master_mode = false,
        .use_mclk = true,
        .digital_mic = false,
        .invert_mclk = false,
        .invert_sclk = false,
        .hw_gain = gain,
    };

    const audio_codec_if_t *es8311_dev = es8311_codec_new(&es8311_cfg);
    ESP_RETURN_ON_FALSE(es8311_dev != NULL, NULL, TAG, "Failed to create ES8311 microphone codec");

    esp_codec_dev_cfg_t codec_es8311_dev_cfg = {
        .dev_type = ESP_CODEC_DEV_TYPE_IN,
        .codec_if = es8311_dev,
        .data_if = i2s_data_if,
    };
    return esp_codec_dev_new(&codec_es8311_dev_cfg);
}

esp_err_t bsp_audio_poweramp_enable(bool enable)
{
    ESP_RETURN_ON_FALSE(bsp_io_expander_init() != NULL, ESP_FAIL, TAG,
                        "Failed to initialize TCA9554");
    BSP_ERROR_CHECK_RETURN_ERR(
        esp_io_expander_set_dir(io_expander, BSP_POWER_AMP_IO, IO_EXPANDER_OUTPUT));
    BSP_ERROR_CHECK_RETURN_ERR(esp_io_expander_set_level(io_expander, BSP_POWER_AMP_IO, (uint8_t)enable));

    return ESP_OK;
}

#define LCD_CMD_BITS (8)
#define LCD_PARAM_BITS (8)
esp_err_t bsp_display_brightness_init(void)
{
    return bsp_display_brightness_set(100);
}

esp_err_t bsp_display_brightness_set(int brightness_percent)
{
    if (panel_handle == NULL)
    {
        ESP_LOGE(TAG, "Panel handle is not initialized");
        return ESP_ERR_INVALID_STATE;
    }

    if (brightness_percent < 0 || brightness_percent > 100)
    {
        ESP_LOGE(TAG, "Invalid brightness percentage. Should be between 0 and 100.");
        return ESP_ERR_INVALID_ARG;
    }

    uint32_t lcd_cmd = 0x51;
    lcd_cmd &= 0xff;
    lcd_cmd <<= 8;
    lcd_cmd |= 0x02 << 24;
    uint8_t param = (uint8_t)(brightness_percent * 255 / 100);
    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(io_handle, lcd_cmd, &param, 1), TAG, "");

    brightness = param;
    return ESP_OK;
}

int bsp_display_brightness_get(void)
{
    if (panel_handle == NULL)
    {
        ESP_LOGE(TAG, "Panel handle is not initialized");
        return -1;
    }

    return brightness * 100 / 255;
}

esp_err_t bsp_display_backlight_off(void)
{
    ESP_LOGI(TAG, "Backlight off");
    return bsp_display_brightness_set(0);
}

esp_err_t bsp_display_backlight_on(void)
{
    ESP_LOGI(TAG, "Backlight on");
    return bsp_display_brightness_set(100);
}

#if LVGL_VERSION_MAJOR >= 9
static void rounder_event_cb(lv_event_t *e)
{
    lv_area_t *area = (lv_area_t *)lv_event_get_param(e);
    area->x1 = (area->x1 >> 1) << 1;
    area->y1 = (area->y1 >> 1) << 1;
    area->x2 = ((area->x2 >> 1) << 1) + 1;
    area->y2 = ((area->y2 >> 1) << 1) + 1;
}
#else
static void bsp_lvgl_rounder_cb(lv_disp_drv_t *disp_drv, lv_area_t *area)
{
    (void)disp_drv;
    area->x1 = (area->x1 >> 1) << 1;
    area->y1 = (area->y1 >> 1) << 1;
    area->x2 = ((area->x2 >> 1) << 1) + 1;
    area->y2 = ((area->y2 >> 1) << 1) + 1;
}
#endif

static esp_err_t bsp_display_create_sh8601(void)
{
    const esp_lcd_panel_io_spi_config_t io_config =
        SH8601_PANEL_IO_QSPI_CONFIG(BSP_LCD_CS, NULL, NULL);
    ESP_RETURN_ON_ERROR(
        esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)BSP_LCD_SPI_NUM, &io_config, &io_handle),
        TAG, "");

    sh8601_vendor_config_t vendor_config = {
        .init_cmds = sh8601_lcd_init_cmds,
        .init_cmds_size = sizeof(sh8601_lcd_init_cmds) / sizeof(sh8601_lcd_init_cmds[0]),
        .flags = {
            .use_qspi_interface = 1,
        },
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = GPIO_NUM_NC,
        .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = &vendor_config,
    };
    return esp_lcd_new_panel_sh8601(io_handle, &panel_config, &panel_handle);
}

static esp_err_t bsp_display_create_co5300(void)
{
    const esp_lcd_panel_io_spi_config_t io_config =
        CO5300_PANEL_IO_QSPI_CONFIG(BSP_LCD_CS, NULL, NULL);
    ESP_RETURN_ON_ERROR(
        esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)BSP_LCD_SPI_NUM, &io_config, &io_handle),
        TAG, "");

    co5300_vendor_config_t vendor_config = {
        .init_cmds = co5300_lcd_init_cmds,
        .init_cmds_size = sizeof(co5300_lcd_init_cmds) / sizeof(co5300_lcd_init_cmds[0]),
        .flags = {
            .use_qspi_interface = 1,
        },
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = GPIO_NUM_NC,
        .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = &vendor_config,
    };
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_co5300(io_handle, &panel_config, &panel_handle), TAG, "");
    return esp_lcd_panel_set_gap(panel_handle, BSP_LCD_CO5300_X_GAP, 0);
}

esp_err_t bsp_display_new(const bsp_display_config_t *config, esp_lcd_panel_handle_t *ret_panel,
                          esp_lcd_panel_io_handle_t *ret_io)
{
    ESP_RETURN_ON_FALSE(bsp_sdcard == NULL, ESP_ERR_INVALID_STATE, TAG,
                        "Display and SD card cannot share SPI2 at the same time");
    ESP_RETURN_ON_FALSE(!lcd_spi_initialized && panel_handle == NULL && io_handle == NULL,
                        ESP_ERR_INVALID_STATE, TAG, "Display is already initialized");

    const bsp_board_variant_t variant = bsp_board_detect();
    ESP_RETURN_ON_FALSE(variant != BSP_BOARD_VARIANT_UNKNOWN, ESP_ERR_NOT_FOUND, TAG,
                        "Unable to detect board variant");

    const size_t default_transfer_size =
        BSP_LCD_H_RES * BSP_LCD_V_RES * BSP_LCD_BITS_PER_PIXEL / 8;
    const size_t transfer_size =
        (config != NULL && config->max_transfer_sz > 0) ? config->max_transfer_sz : default_transfer_size;
    esp_err_t ret;

    ESP_LOGI(TAG, "Initialize QSPI display for %s", bsp_board_variant_to_name(variant));
    if (variant == BSP_BOARD_VARIANT_CO5300_CST820) {
        const spi_bus_config_t bus_config =
            CO5300_PANEL_BUS_QSPI_CONFIG(BSP_LCD_PCLK, BSP_LCD_DATA0, BSP_LCD_DATA1,
                                         BSP_LCD_DATA2, BSP_LCD_DATA3, transfer_size);
        ret = spi_bus_initialize(BSP_LCD_SPI_NUM, &bus_config, SPI_DMA_CH_AUTO);
        if (ret != ESP_OK) {
            return ret;
        }
        lcd_spi_initialized = true;
        ret = bsp_display_create_co5300();
    } else {
        const spi_bus_config_t bus_config =
            SH8601_PANEL_BUS_QSPI_CONFIG(BSP_LCD_PCLK, BSP_LCD_DATA0, BSP_LCD_DATA1,
                                         BSP_LCD_DATA2, BSP_LCD_DATA3, transfer_size);
        ret = spi_bus_initialize(BSP_LCD_SPI_NUM, &bus_config, SPI_DMA_CH_AUTO);
        if (ret != ESP_OK) {
            return ret;
        }
        lcd_spi_initialized = true;
        ret = bsp_display_create_sh8601();
    }
    if (ret != ESP_OK) {
        goto fail;
    }

    ret = esp_lcd_panel_reset(panel_handle);
    if (ret != ESP_OK) {
        goto fail;
    }
    ret = esp_lcd_panel_init(panel_handle);
    if (ret != ESP_OK) {
        goto fail;
    }
    ret = esp_lcd_panel_disp_on_off(panel_handle, true);
    if (ret != ESP_OK) {
        goto fail;
    }

