waveshareteam/Waveshare-ESP32-components/bsp/esp32_c6_touch_amoled_1_8/esp32_c6_touch_amoled_1_8.c
    if (ret_panel != NULL) {
        *ret_panel = panel_handle;
    }
    if (ret_io != NULL) {
        *ret_io = io_handle;
    }
    return ESP_OK;

fail:
    if (panel_handle != NULL) {
        (void)esp_lcd_panel_del(panel_handle);
        panel_handle = NULL;
    }
    if (io_handle != NULL) {
        (void)esp_lcd_panel_io_del(io_handle);
        io_handle = NULL;
    }
    if (lcd_spi_initialized) {
        (void)spi_bus_free(BSP_LCD_SPI_NUM);
        lcd_spi_initialized = false;
    }
    return ret;
}

esp_err_t bsp_touch_new(const bsp_touch_config_t *config, esp_lcd_touch_handle_t *ret_touch)
{
    (void)config;
    ESP_RETURN_ON_FALSE(ret_touch != NULL, ESP_ERR_INVALID_ARG, TAG, "Touch output handle is required");

    const bsp_board_variant_t variant = bsp_board_detect();
    ESP_RETURN_ON_FALSE(variant != BSP_BOARD_VARIANT_UNKNOWN, ESP_ERR_NOT_FOUND, TAG,
                        "Unable to detect board variant");

    const esp_lcd_touch_config_t touch_config = {
        .x_max = BSP_LCD_H_RES,
        .y_max = BSP_LCD_V_RES,
        .rst_gpio_num = GPIO_NUM_NC,
        .int_gpio_num = BSP_LCD_TOUCH_INT,
        .levels = {
            .reset = 0,
            .interrupt = 0,
        },
        .flags = {
            .swap_xy = 0,
            .mirror_x = 0,
            .mirror_y = 0,
        },
    };

    esp_lcd_panel_io_i2c_config_t io_config;
    esp_err_t (*touch_new)(esp_lcd_panel_io_handle_t, const esp_lcd_touch_config_t *,
                           esp_lcd_touch_handle_t *) = NULL;
    if (variant == BSP_BOARD_VARIANT_CO5300_CST820) {
        const esp_lcd_panel_io_i2c_config_t cst816s_driver_config =
            ESP_LCD_TOUCH_IO_I2C_CST816S_CONFIG();
        io_config = cst816s_driver_config;
        touch_new = esp_lcd_touch_new_i2c_cst816s;
    } else {
        const esp_lcd_panel_io_i2c_config_t ft5x06_config =
            ESP_LCD_TOUCH_IO_I2C_FT5x06_CONFIG();
        io_config = ft5x06_config;
        touch_new = esp_lcd_touch_new_i2c_ft5x06;
    }

    io_config.scl_speed_hz = CONFIG_BSP_I2C_CLK_SPEED_HZ;
    esp_lcd_panel_io_handle_t touch_io = NULL;
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i2c(i2c_handle, &io_config, &touch_io), TAG, "");
    return touch_new(touch_io, &touch_config, ret_touch);
}

/**************************************************************************************************
 *
 * IO Expander Function
 *
 **************************************************************************************************/
esp_io_expander_handle_t bsp_io_expander_init(void)
{
    if (bsp_i2c_init() != ESP_OK) {
        return NULL;
    }
    if (io_expander == NULL) {
        const esp_err_t ret =
            esp_io_expander_new_i2c_tca9554(i2c_handle, BSP_IO_EXPANDER_I2C_ADDRESS, &io_expander);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to initialize TCA9554: %s", esp_err_to_name(ret));
            return NULL;
        }
    }
    return io_expander;
}

static lv_display_t *bsp_display_lcd_init(const bsp_display_cfg_t *cfg)
{
    assert(cfg != NULL);
    const bsp_display_config_t display_config = {
        .max_transfer_sz = cfg->trans_size,
    };
    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_new(&display_config, &panel_handle, &io_handle));

    const lvgl_port_display_cfg_t display_cfg = {
        .io_handle = io_handle,
        .panel_handle = panel_handle,
        .buffer_size = cfg->buffer_size,
        .double_buffer = cfg->double_buffer,
        .monochrome = false,
        .hres = BSP_LCD_H_RES,
        .vres = BSP_LCD_V_RES,
#if LVGL_VERSION_MAJOR >= 9
        .color_format = LV_COLOR_FORMAT_RGB565,
#endif
        .rotation = {
            .swap_xy = false,
            .mirror_x = false,
            .mirror_y = false,
        },
        .flags = {
            .sw_rotate = true,
            .buff_dma = cfg->flags.buff_dma,
            .buff_spiram = cfg->flags.buff_spiram,
            .full_refresh = 0,
            .direct_mode = 0,
#if LVGL_VERSION_MAJOR >= 9
            .swap_bytes = true,
#endif
        },
    };

    lv_display_t *display = lvgl_port_add_disp(&display_cfg);
    if (display == NULL) {
        return NULL;
    }
#if LVGL_VERSION_MAJOR >= 9
    lv_display_add_event_cb(display, rounder_event_cb, LV_EVENT_INVALIDATE_AREA, NULL);
#else
    lv_disp_t *display_v8 = (lv_disp_t *)display;
    if (display_v8->driver != NULL) {
        display_v8->driver->rounder_cb = bsp_lvgl_rounder_cb;
    }
#endif
    return display;
}

static lv_indev_t *bsp_display_indev_init(lv_display_t *disp)
{
    BSP_ERROR_CHECK_RETURN_NULL(bsp_touch_new(NULL, &tp));
    assert(tp);

    /* Add touch input (for selected screen) */
    const lvgl_port_touch_cfg_t touch_cfg = {
        .disp = disp,
        .handle = tp,
    };

    return lvgl_port_add_touch(&touch_cfg);
}

/**********************************************************************************************************
 *
 * Display Function
 *
 **********************************************************************************************************/
lv_display_t *bsp_display_start(void)
{
    bsp_display_cfg_t cfg = {
        .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
        .buffer_size = BSP_LCD_DRAW_BUFF_SIZE,
        .double_buffer = BSP_LCD_DRAW_BUFF_DOUBLE,
        .flags = {
            .buff_dma = false,
            .buff_spiram = false,
        }};
    return bsp_display_start_with_config(&cfg);
}

lv_display_t *bsp_display_start_with_config(const bsp_display_cfg_t *cfg)
{
    lv_display_t *disp;

    assert(cfg != NULL);
    BSP_ERROR_CHECK_RETURN_NULL(lvgl_port_init(&cfg->lvgl_port_cfg));

    BSP_NULL_CHECK(disp = bsp_display_lcd_init(cfg), NULL);

    BSP_NULL_CHECK(disp_indev = bsp_display_indev_init(disp), NULL);

    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_brightness_init());

    return disp;
}

lv_indev_t *bsp_display_get_input_dev(void)
{
    return disp_indev;
}

void bsp_display_rotate(lv_display_t *disp, lv_disp_rotation_t rotation)
{
    lv_disp_set_rotation(disp, rotation);
}

bool bsp_display_lock(uint32_t timeout_ms)
{
    return lvgl_port_lock(timeout_ms);
}

void bsp_display_unlock(void)
{
    lvgl_port_unlock();
}
